org/quaternary_multiplication.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-14 Sun 10:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Nithin" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4c51773">1. Quaternary Multiplication Using Bitwise Operations</a></li>
<li><a href="#org5a93214">2. Binary Multiplication of 2-bit Numbers</a>
<ul>
<li><a href="#org91a74b4">2.1. Introduction</a></li>
<li><a href="#orgab17e1e">2.2. Problem Statement</a></li>
<li><a href="#org98a840a">2.3. Representation</a></li>
<li><a href="#org97d0d2e">2.4. Steps for Multiplication</a></li>
<li><a href="#org33eecbb">2.5. Detailed Steps</a></li>
<li><a href="#orgc28b0c9">2.6. Result</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4c51773" class="outline-2">
<h2 id="org4c51773"><span class="section-number-2">1.</span> Quaternary Multiplication Using Bitwise Operations</h2>
</div>

<div id="outline-container-org5a93214" class="outline-2">
<h2 id="org5a93214"><span class="section-number-2">2.</span> Binary Multiplication of 2-bit Numbers</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org91a74b4" class="outline-3">
<h3 id="org91a74b4"><span class="section-number-3">2.1.</span> Introduction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This document describes the process of performing binary multiplication of two 2-bit numbers. It highlights the steps involved, including calculating partial products and summing them, taking into account the necessary bit positions and carries.
</p>
</div>
</div>

<div id="outline-container-orgab17e1e" class="outline-3">
<h3 id="orgab17e1e"><span class="section-number-3">2.2.</span> Problem Statement</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Given two 2-bit binary numbers, we need to multiply them using bitwise operations and properly align and sum the partial products.
</p>
</div>
</div>

<div id="outline-container-org98a840a" class="outline-3">
<h3 id="org98a840a"><span class="section-number-3">2.3.</span> Representation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Let’s denote the two 2-bit numbers as <code>a</code> and <code>b</code>, where:
</p>
<ul class="org-ul">
<li><code>a = a_1a_0</code> (with <code>a1</code> and <code>a0</code> being the MSB and LSB of <code>a</code>, respectively)</li>
<li><code>b = b_1b_0</code> (with <code>b1</code> and <code>b0</code> being the MSB and LSB of <code>b</code>, respectively)</li>
</ul>
</div>
</div>

<div id="outline-container-org97d0d2e" class="outline-3">
<h3 id="org97d0d2e"><span class="section-number-3">2.4.</span> Steps for Multiplication</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Extract the bits from each 2-bit number.</li>
<li>Compute the partial products using bitwise AND operations.</li>
<li>Align the partial products according to their bit positions.</li>
<li>Sum the aligned partial products to produce the final result.</li>
</ol>
</div>
</div>

<div id="outline-container-org33eecbb" class="outline-3">
<h3 id="org33eecbb"><span class="section-number-3">2.5.</span> Detailed Steps</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Extract the Bits:
<ul class="org-ul">
<li><code>a0 = a &amp; 0b01</code></li>
<li><code>a1 = (a &gt;&gt; 1) &amp; 0b01</code></li>
<li><code>b0 = b &amp; 0b01</code></li>
<li><code>b1 = (b &gt;&gt; 1) &amp; 0b01</code></li>
</ul></li>

<li><p>
Calculate Partial Products:
</p>

<table id="org001f902" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">b<sub>1</sub></th>
<th scope="col" class="org-left">b<sub>0</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a<sub>1</sub></td>
<td class="org-left">a<sub>1</sub> b<sub>1</sub></td>
<td class="org-left">a<sub>1</sub> b<sub>0</sub></td>
</tr>

<tr>
<td class="org-left">a<sub>0</sub></td>
<td class="org-left">a<sub>0</sub> b<sub>1</sub></td>
<td class="org-left">a<sub>0</sub> b<sub>0</sub></td>
</tr>
</tbody>
</table></li>

<li><p>
Align Partial Products:
</p>

<table id="orged8e3a8" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a<sub>1</sub> b<sub>1</sub></td>
<td class="org-left">a<sub>1</sub> b<sub>0</sub></td>
</tr>

<tr>
<td class="org-left">a<sub>0</sub> b<sub>1</sub></td>
<td class="org-left">a<sub>0</sub> b<sub>0</sub></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>

<li><p>
Sum Partial Products:
</p>

<p>
a<sub>1</sub> b<sub>1</sub> &sdot; 2<sup>2</sup> + (a<sub>1</sub> b<sub>0</sub> + a<sub>0</sub> b<sub>1</sub>) &sdot; 2<sup>1</sup> + a<sub>0</sub> b<sub>0</sub> &sdot; 2<sup>0</sup>
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgc28b0c9" class="outline-3">
<h3 id="orgc28b0c9"><span class="section-number-3">2.6.</span> Result</h3>
<div class="outline-text-3" id="text-2-6">
<p>
By summing the aligned partial products, the final result of the binary multiplication is obtained. This process involves careful alignment and addition to ensure that all carries are appropriately handled.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nithin</p>
<p class="date">Created: 2024-07-14 Sun 10:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
